cases/05_pitch_decay/background/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    FS_outer
    {
        type searchableBox;
        min  (-100 -80 -5);
        max  ( 100  80  5);
    }

    FS_mid
    {
        type searchableBox;
        min  (-80 -68 -16);
        max  ( 66  68  16);
    }

    FS_inner
    {
        type searchableBox;
        min  (-60 -56 -8);
        max  ( 46  56  8);
    }


    componentWrap
    {
        type searchableBox;
        min  (-54.5 -50 -35);
        max  ( 40  50  26.5);
    }


    fringeFS
    {
        type searchableBox;
        min  (-43 -39 -4);
        max  ( 28  39  4);
    }
};

castellatedMeshControls
{
    maxLocalCells       600000;
    maxGlobalCells      6000000;     
    minRefinementCells  0;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;        

    features ();

    refinementSurfaces
    {
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        FS_outer      { mode inside; levels ((1 1)); }  
        FS_mid        { mode inside; levels ((1 1)); }  
        FS_inner      { mode inside; levels ((2 2)); }  
        fringeFS      { mode inside; levels ((2 2)); }   
        componentWrap { mode inside; levels ((1 1)); }  
    }

    locationInMesh      (-97.3 -74.7 27.1);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    expansionRatio      1.0;
    finalLayerThickness 0.3;
    minThickness        0.1;
    layers              {}
    nGrow               0;
    featureAngle        130;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 1;
    nSmoothThickness    10;
    minMedialAxisAngle  90;
    maxThicknessToMedialRatio 0.3;
    nSmoothNormals      3;
    slipFeatureAngle    30;
    nRelaxIter          5;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
    nRelaxedIter        20;
}

meshQualityControls
{
    #include "meshQualityDict"
    relaxed { maxNonOrtho 75; }
    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-6;

// ************************************************************************* //
