cases/05_pitch_decay/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            waveVelocity;
        waveDictName    waveProperties;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            waveVelocity;
        waveDictName    waveProperties;
        value           uniform (0 0 0);
    }

    sides
    {
        type            slip;
    }

    bottom
    {
        type            symmetry;
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    float
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    oversetPatch
    {
        patchType       overset;
        type            overset;
    }
}


// ************************************************************************* //
