cases/05_pitch_decay/background/system/setFieldsDict.donor
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    //volScalarFieldValue zoneID 123
);

regions
(
    // Option A1: SWL at z = 0 (true datum). Body is at IC pose (hull
    // bottom z = -19), so its design draft sits 1 m above the SWL — i.e.
    // +1 m heave IC, matching standalone OpenFAST PtfmHeave = 1.
    boxToCell
    {
        box ( -1000 -1000 -1000 ) ( 1000 1000 0 );
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);


// ************************************************************************* //
